---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawRoofError
source: html/089c388d-6531-0022-4500-961bb03e433b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawRoofError Property

Can't make roof.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawRoofError { get; }
```